app/Controllers/AllMealController.php

SELECT *
FROM `individual_meal`
SELECT *
FROM `users`
WHERE `uuid` = '123'
 LIMIT 1
---
    public function ajax($method)
    {
        $individualMealModel = new IndividualMealModel();

        if ($method == 'get-all-meals') {
            // Load the models
            $individualMealModel = new IndividualMealModel();
            $userModel = new UserModel();

            // Fetch all meals
            $meals = $individualMealModel->findAll();

            // Initialize an array to hold the combined data
            $combinedData = [];

            // Loop through each meal and fetch the corresponding user data
            foreach ($meals as $meal) {
                $member_uuid = $meal['member_uuid'];
                $user = $userModel->where('uuid', $member_uuid)->first();