app/Controllers/BazarController.php

    public function ajax($method)
    {

            if ($method == 'get-all-bazars') {
                $bazarModel = new BazarModel();
                $mealModel = new MealModel();
                $userModel = new UserModel();

                // Fetch active meal data
                $mealData = $mealModel->where('status', 'active')->first();
                if ($mealData==null) {
                    return $this->response->setJSON(['status' => 'error', 'message' => 'Please start a new meal first']);
                }
                $meal_uuid = $mealData['meal_uuid'];

                // Fetch bazars for the active meal
                $bazars = $bazarModel->where('meal_uuid', $meal_uuid)->findAll();

                // Enhance bazars with user names
                foreach ($bazars as &$bazar) {
                    $member_uuid = $bazar['member_uuid'];
                    $user = $userModel->where('uuid', $member_uuid)->first();
---
SELECT *
FROM `meal`
WHERE `status` = 'active'
 LIMIT 1
SELECT *
FROM `bazars`
WHERE `meal_uuid` = 'a65c685c999ff76e3219'
SELECT *
FROM `users`
WHERE `uuid` = '123'
 LIMIT 1

            $mealModel = new MealModel();
            $json = $this->request->getJSON();
            $uuid = $this->session->get('uuid');
            $mealData = $mealModel->where('status', 'active')->first();
---
SELECT *
FROM `meal`
WHERE `status` = 'active'
 LIMIT 1

                'details'  => $json->details
            ];

            $flag = $bazarModel->insert($data, false);
---
INSERT INTO `bazars` (`meal_uuid`, `total`, `date`, `member_uuid`, `details`) VALUES ('a65c685c999ff76e3219', '1000', '2024-08-06', '123', 'lau,sakh,mach,murgi')