app/Controllers/IndividualMealController.php

            $individualMealModel = new IndividualMealModel();
            $userModel = new UserModel();
            $mealModel = new MealModel();
            $mealData = $mealModel->where('status', 'active')->first();
---
SELECT *
FROM `meal`
WHERE `status` = 'active'
 LIMIT 1