app/Controllers/IndividualMealController.php

    public function ajax($method)
    {
        $individualMealModel = new IndividualMealModel();

        if ($method == 'get-todays-meals') {
            // Load the models
            $individualMealModel = new IndividualMealModel();
            $userModel = new UserModel();

            // Fetch all meals
            $meals = $individualMealModel->findAll();

            // Initialize an array to hold the combined data
            $combinedData = [];

            // Loop through each meal and fetch the corresponding user data
            foreach ($meals as $meal) {
                $member_uuid = $meal['member_uuid'];
                $user = $userModel->where('uuid', $member_uuid)->first();
---
SELECT *
FROM `individual_meal`
SELECT *
FROM `users`
WHERE `uuid` = '123'
 LIMIT 1

            $userModel = new UserModel();
            $json = $this->request->getJSON();
            $id = $this->request->getGet('id');
            $userData = $userModel->where('id', $id)->first();
            $uuid = $userData['uuid'];

            $mealData = $mealModel->where('status', 'active')->first();
---
SELECT *
FROM `users`
WHERE `id` = '20'
 LIMIT 1
SELECT *
FROM `meal`
WHERE `status` = 'active'
 LIMIT 1

                'total'    => $total
            ];

            $flag = $individualMealModel->insert($data, false);
---
INSERT INTO `individual_meal` (`date`, `launch`, `dinner`, `guest`, `meal_uuid`, `member_uuid`, `total`) VALUES ('2024-08-04', '1', '1', '2', 'a64c6531eca60239b963', 'b26f083d6c9c796bc06e', 4)