app/Controllers/MealController.php

        public function ajax($method)
        {
            $mealModel = new MealModel();

            if ($method == 'get-all-meals') {
                $meals = $mealModel->findAll();
---
SELECT *
FROM `meal`