app/Controllers/MoneyController.php

    public function ajax($method){

       if($method == 'get-depositions'){
           $moneyModel = new MoneyModel();
           $userModel = new UserModel();
           $mealModel = new MealModel();
           $mealData = $mealModel->where('status', 'active')->first();
           $meal_uuid = $mealData['meal_uuid'];
           $id = $this->request->getGet('id');
           $userData = $userModel->find($id);
           $uuid = $userData['uuid'];
           $money = $moneyModel
                   ->where('member_uuid', $uuid)
                   ->where('meal_uuid',$meal_uuid)
                   ->findAll();

           return $this->response->setJSON($money);
       }
       if($method == 'add-money'){
        $moneyModel = new MoneyModel();
        $id = $this->request->getGet('id');
        $userModel = new UserModel();
        $userData = $userModel->find($id);
        $uuid = $userData['uuid'];
        $mealModel = new MealModel();
        $mealData = $mealModel->where('status', 'active')->first();
---
SELECT *
FROM `meal`
WHERE `status` = 'active'
 LIMIT 1
SELECT *
FROM `users`
WHERE `users`.`id` = '18'
SELECT *
FROM `money`
WHERE `member_uuid` = 'c8dfb7ea930297e0543a'
AND `meal_uuid` = 'a64c6531eca60239b963'
SELECT *
FROM `users`
WHERE `users`.`id` = '20'

            'date' => $json->date,
        ];

        $flag = $moneyModel->insert($data, false);
---
INSERT INTO `money` (`member_uuid`, `meal_uuid`, `deposite`, `date`) VALUES ('b26f083d6c9c796bc06e', 'a65c685c999ff76e3219', '15000', '2024-08-06')