app/Controllers/UserController.php

    public function getMembers()
    {
        $users = new UserModel();
        $data = $users->findAll();
---
SELECT *
FROM `users`