app/Controllers/UserController.php

SELECT *
FROM `users`
---
    public function getMembers()
    {
        $users = new UserModel();
        $data = $users->findAll();