app/Models/UserModel.php

   public function login($email=null,$pass=null){

      if($this->where(['email'=>$email,'password'=>$pass])->countAllResults()==1) return 1;
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `email` = 'admin@gmail.com'
AND `password` = 'admin'